#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_ses.aws_ses_domain_dkim.app["docklandssinfonia.co.uk"] will be created
  + resource "aws_ses_domain_dkim" "app" {
      + dkim_tokens = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + id          = (known after apply)
    }

  # module.aws_ses.aws_ses_domain_dkim.app["spencerdown.com"] will be created
  + resource "aws_ses_domain_dkim" "app" {
      + dkim_tokens = (known after apply)
      + domain      = "spencerdown.com"
      + id          = (known after apply)
    }

  # module.aws_ses.aws_ses_domain_identity.app["docklandssinfonia.co.uk"] will be created
  + resource "aws_ses_domain_identity" "app" {
      + arn                = (known after apply)
      + domain             = "docklandssinfonia.co.uk"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # module.aws_ses.aws_ses_domain_identity.app["spencerdown.com"] will be created
  + resource "aws_ses_domain_identity" "app" {
      + arn                = (known after apply)
      + domain             = "spencerdown.com"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

  # module.aws_ses.aws_ses_domain_mail_from.app["docklandssinfonia.co.uk"] will be created
  + resource "aws_ses_domain_mail_from" "app" {
      + behavior_on_mx_failure = "RejectMessage"
      + domain                 = "docklandssinfonia.co.uk"
      + id                     = (known after apply)
      + mail_from_domain       = "email.docklandssinfonia.co.uk"
    }

  # module.aws_ses.aws_ses_domain_mail_from.app["spencerdown.com"] will be created
  + resource "aws_ses_domain_mail_from" "app" {
      + behavior_on_mx_failure = "RejectMessage"
      + domain                 = "spencerdown.com"
      + id                     = (known after apply)
      + mail_from_domain       = "email.spencerdown.com"
    }

  # module.cloudflare.cloudflare_page_rule.root_redirect["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_page_rule" "root_redirect" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "docklandssinfonia.co.uk/*"
      + zone     = "docklandssinfonia.co.uk"
      + zone_id  = (known after apply)

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false

          + forwarding_url {
              + status_code = 301
              + url         = "https://www.docklandssinfonia.co.uk/$1"
            }
        }
    }

  # module.cloudflare.cloudflare_page_rule.root_redirect["spencerdown.com"] will be created
  + resource "cloudflare_page_rule" "root_redirect" {
      + id       = (known after apply)
      + priority = 1
      + status   = "active"
      + target   = "spencerdown.com/*"
      + zone     = "spencerdown.com"
      + zone_id  = (known after apply)

      + actions {
          + always_use_https    = false
          + disable_apps        = false
          + disable_performance = false
          + disable_railgun     = false
          + disable_security    = false

          + forwarding_url {
              + status_code = 301
              + url         = "https://www.spencerdown.com/$1"
            }
        }
    }

  # module.cloudflare.cloudflare_record.dmarc["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "dmarc" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_dmarc"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=DMARC1; p=reject"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.dmarc["spencerdown.com"] will be created
  + resource "cloudflare_record" "dmarc" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_dmarc"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=DMARC1; p=reject"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_domainkey["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_domainkey" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "google._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCyV3nvb2VsVawzCX/CEHLzm5ehMv37oKJa9OxSD+/Gii1MnzHkiNeRhXSAGviLmX3XndSDoAYoMTuAYCEhOm15ibO4ZW+iGcevuHAaSvEmlYAGUQwqvuUe78V5q8DzpGJ7oCscMSyTs5z73YVMUH33R+uK5d1Vv+lM0OkTGOLGlQIDAQAB"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_domainkey["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_domainkey" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "google._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC6f+YQCiuUPGgLcr0wAt91SLfZTPmqz7lBkr1aLEAQQ/5IAbq8LfauU+brIhmSVvdnvV581GkDFFUddnkMaEAhIFhDU553gCc0b+agjofv73I/liG9VpxIscsXc2PtlsH14e2byzJLREr8lE9YfyzuSjlrOqoIptzWQ+bokf1wLQIDAQAB"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_0["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_mx_0" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + priority    = 1
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_0["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_mx_0" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + priority    = 1
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_1["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_mx_1" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + priority    = 2
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt1.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_1["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_mx_1" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + priority    = 2
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt1.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_2["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_mx_2" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + priority    = 2
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt2.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_2["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_mx_2" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + priority    = 2
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt2.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_3["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_mx_3" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + priority    = 3
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt3.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_3["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_mx_3" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + priority    = 3
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt3.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_4["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "gsuite_mx_4" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + priority    = 3
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt4.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.gsuite_mx_4["spencerdown.com"] will be created
  + resource "cloudflare_record" "gsuite_mx_4" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + priority    = 3
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "alt4.aspmx.l.google.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.mailchimp_domainkey["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "mailchimp_domainkey" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "k1._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "dkim.mcsv.net"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.mailchimp_domainkey["spencerdown.com"] will be created
  + resource "cloudflare_record" "mailchimp_domainkey" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "k1._domainkey"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "dkim.mcsv.net"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_0["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_domainkey_0" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_0["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_domainkey_0" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_1["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_domainkey_1" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_1["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_domainkey_1" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_2["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_domainkey_2" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_domainkey_2["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_domainkey_2" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = (known after apply)
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_mx["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_mail_from_mx" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.docklandssinfonia.co.uk"
      + priority    = 10
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "feedback-smtp.eu-west-1.amazonses.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_mx["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_mail_from_mx" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.spencerdown.com"
      + priority    = 10
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "MX"
      + value       = "feedback-smtp.eu-west-1.amazonses.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_spf["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_mail_from_spf" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:amazonses.com -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_mail_from_spf["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_mail_from_spf" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "email.spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:amazonses.com -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_verification_token["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "ses_verification_token" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_amazonses"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.ses_verification_token["spencerdown.com"] will be created
  + resource "cloudflare_record" "ses_verification_token" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "_amazonses"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = (known after apply)
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_root["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "site_root" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_root["spencerdown.com"] will be created
  + resource "cloudflare_record" "site_root" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_www["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "site_www" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.site_www["spencerdown.com"] will be created
  + resource "cloudflare_record" "site_www" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "www"
      + proxiable   = (known after apply)
      + proxied     = true
      + ttl         = (known after apply)
      + type        = "CNAME"
      + value       = "obduk-cms-production.herokuapp.com"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.spf["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_record" "spf" {
      + created_on  = (known after apply)
      + domain      = "docklandssinfonia.co.uk"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "docklandssinfonia.co.uk"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:_spf.google.com include:servers.mcsv.net -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_record.spf["spencerdown.com"] will be created
  + resource "cloudflare_record" "spf" {
      + created_on  = (known after apply)
      + domain      = "spencerdown.com"
      + hostname    = (known after apply)
      + id          = (known after apply)
      + metadata    = (known after apply)
      + modified_on = (known after apply)
      + name        = "spencerdown.com"
      + proxiable   = (known after apply)
      + proxied     = false
      + ttl         = (known after apply)
      + type        = "TXT"
      + value       = "v=spf1 include:_spf.google.com include:servers.mcsv.net -all"
      + zone_id     = (known after apply)
    }

  # module.cloudflare.cloudflare_zone.main["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_zone" "main" {
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + zone                = "docklandssinfonia.co.uk"
    }

  # module.cloudflare.cloudflare_zone.main["spencerdown.com"] will be created
  + resource "cloudflare_zone" "main" {
      + id                  = (known after apply)
      + meta                = (known after apply)
      + name_servers        = (known after apply)
      + plan                = (known after apply)
      + status              = (known after apply)
      + type                = "full"
      + vanity_name_servers = (known after apply)
      + zone                = "spencerdown.com"
    }

  # module.cloudflare.cloudflare_zone_settings_override.main["docklandssinfonia.co.uk"] will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + name                     = "docklandssinfonia.co.uk"
      + readonly_settings        = (known after apply)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = "simplified"
          + challenge_ttl               = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + edge_cache_ttl              = (known after apply)
          + email_obfuscation           = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = (known after apply)
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = "off"
          + sha1_support                = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "full"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)

          + minify {
              + css  = (known after apply)
              + html = (known after apply)
              + js   = (known after apply)
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = true
              + include_subdomains = true
              + max_age            = 31536000
              + nosniff            = true
              + preload            = true
            }
        }
    }

  # module.cloudflare.cloudflare_zone_settings_override.main["spencerdown.com"] will be created
  + resource "cloudflare_zone_settings_override" "main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + name                     = "spencerdown.com"
      + readonly_settings        = (known after apply)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = "simplified"
          + challenge_ttl               = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + edge_cache_ttl              = (known after apply)
          + email_obfuscation           = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = (known after apply)
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = "off"
          + sha1_support                = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "full"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)

          + minify {
              + css  = (known after apply)
              + html = (known after apply)
              + js   = (known after apply)
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = true
              + include_subdomains = true
              + max_age            = 31536000
              + nosniff            = true
              + preload            = true
            }
        }
    }

  # module.datadog.datadog_synthetics_test.main["www.docklandssinfonia.co.uk"] will be created
  + resource "datadog_synthetics_test" "main" {
      + assertions = [
          + {
              + "operator" = "is"
              + "target"   = "200"
              + "type"     = "statusCode"
            },
          + {
              + "operator" = "is"
              + "property" = "content-type"
              + "target"   = "text/html; charset=utf-8"
              + "type"     = "header"
            },
          + {
              + "operator" = "lessThan"
              + "target"   = "6000"
              + "type"     = "responseTime"
            },
        ]
      + id         = (known after apply)
      + locations  = [
          + "aws:ca-central-1",
          + "aws:eu-central-1",
          + "aws:eu-west-1",
          + "aws:eu-west-2",
          + "aws:us-east-2",
          + "aws:us-west-1",
          + "aws:us-west-2",
        ]
      + message    = "Notify @all"
      + monitor_id = (known after apply)
      + name       = "www.docklandssinfonia.co.uk"
      + options    = {
          + "min_failure_duration" = "180"
          + "min_location_failed"  = "2"
          + "tick_every"           = "60"
        }
      + request    = {
          + "method"  = "GET"
          + "timeout" = "30"
          + "url"     = "https://www.docklandssinfonia.co.uk/home?monitoring=skip"
        }
      + status     = "live"
      + tags       = [
          + "cms",
          + "terraform",
        ]
      + type       = "api"
    }

  # module.datadog.datadog_synthetics_test.main["www.spencerdown.com"] will be created
  + resource "datadog_synthetics_test" "main" {
      + assertions = [
          + {
              + "operator" = "is"
              + "target"   = "200"
              + "type"     = "statusCode"
            },
          + {
              + "operator" = "is"
              + "property" = "content-type"
              + "target"   = "text/html; charset=utf-8"
              + "type"     = "header"
            },
          + {
              + "operator" = "lessThan"
              + "target"   = "6000"
              + "type"     = "responseTime"
            },
        ]
      + id         = (known after apply)
      + locations  = [
          + "aws:ca-central-1",
          + "aws:eu-central-1",
          + "aws:eu-west-1",
          + "aws:eu-west-2",
          + "aws:us-east-2",
          + "aws:us-west-1",
          + "aws:us-west-2",
        ]
      + message    = "Notify @all"
      + monitor_id = (known after apply)
      + name       = "www.spencerdown.com"
      + options    = {
          + "min_failure_duration" = "180"
          + "min_location_failed"  = "2"
          + "tick_every"           = "60"
        }
      + request    = {
          + "method"  = "GET"
          + "timeout" = "30"
          + "url"     = "https://www.spencerdown.com/home?monitoring=skip"
        }
      + status     = "live"
      + tags       = [
          + "cms",
          + "terraform",
        ]
      + type       = "api"
    }

Plan: 48 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `CI`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform/app_environment`, Workspace: `production`*
